In [1]:
import pandas as pd
import psycopg2
import numpy as np

import boto3
from io import StringIO, BytesIO

In [2]:
dbname = "dev"
host = "redshift-cluster-1.c9gt5btzchps.eu-central-1.redshift.amazonaws.com"
port = 5439
user = "candice"
password = "jw8s0F4123"

In [3]:
def connect_to_redshift(dbname, host, port, user, password):
    """Method that connects to redshift. This gives a warning so will look for another solution"""

    connect = psycopg2.connect(
        dbname=dbname, host=host, port=port, user=user, password=password
    )

    print("connection to redshift made")

    return connect

In [4]:
# check the connection
connect = connect_to_redshift(dbname=dbname, host=host, port=port, user=user, password=password)

connection to redshift made

In [5]:
query = """select *
        from bootcamp.stock_description"""


stock_desc = pd.read_sql(query, connect)
stock_desc.head(10)

C:\Users\warre\AppData\Local\Temp\ipykernel_12732\2574093289.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  stock_desc = pd.read_sql(query, connect)

  stock_code                   description
0      10002   INFLATABLE POLITICAL GLOBE
1      10080      GROOVY CACTUS INFLATABLE
2      10120                  DOGGY RUBBER
3     10123C         HEARTS WRAPPING TAPE
4     10124A   SPOTS ON RED BOOKCOVER TAPE
5     10124G      ARMY CAMO BOOKCOVER TAPE
6      10125       MINI FUNKY DESIGN TAPES
7      10133  COLOURING PENCILS BROWN TUBE
8      10135  COLOURING PENCILS BROWN TUBE
9      11001   ASSTD DESIGN RACING CAR PEN

In [6]:
stock_desc.shape

(3952, 2)

In [7]:
query = """select *
        from bootcamp.online_transactions"""


online_trans = pd.read_sql(query, connect)
online_trans.head(10)

C:\Users\warre\AppData\Local\Temp\ipykernel_12732\3739319960.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  online_trans = pd.read_sql(query, connect)

,invoice,stock_code,quantity,invoice_date,price,customer_id,country
0,536366,22632,6,2010-12-01 08:28:00,1.85,u1785,United Kingdom
1,536367,22749,8,2010-12-01 08:34:00,3.75,u13047,United Kingdom
2,536367,22622,2,2010-12-01 08:34:00,9.95,u13047,United Kingdom
3,536370,22659,24,2010-12-01 08:45:00,1.95,u12583,France
4,536370,22492,36,2010-12-01 08:45:00,0.65,u12583,France
5,536372,22633,6,2010-12-01 09:01:00,1.85,u1785,United Kingdom
6,536373,20679,6,2010-12-01 09:02:00,4.95,u1785,United Kingdom
7,536373,21068,6,2010-12-01 09:02:00,1.06,u1785,United Kingdom
8,536375,21071,6,2010-12-01 09:32:00,1.06,u1785,United Kingdom
9,536375,22752,2,2010-12-01 09:32:00,7.65,u1785,United Kingdom

In [8]:
online_trans.shape

(541910, 7)

In [9]:
query = """
        select ot.customer_id,
               ot.invoice, 
               ot.stock_code,
               ot.quantity,
               ot.price,
               ot.country,
                  /*this is code to replace the missing values in description with unknown*/
                  case when sd.description is null then 'Unknown' 
                      else sd.description end as description,
                /*this is code to fix the invoice_date's data type(the last one does not need a comma*/
                  cast(ot.invoice_date as datetime) as invoice_date
           from bootcamp.online_transactions as ot
           left join (select *
                     from bootcamp.stock_description 
                     where description <> '?') sd on ot.stock_code = sd.stock_code
           where ot.customer_id <> ''
               and ot.stock_code not in ('BANK CHARGES', 'POST', 'D', 'M', 'CRUK')              
"""
online_trans_w_desc = pd.read_sql(query, connect)
online_trans_w_desc

C:\Users\warre\AppData\Local\Temp\ipykernel_12732\1886596684.py:20: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  online_trans_w_desc = pd.read_sql(query, connect)

,customer_id,invoice,stock_code,quantity,price,country,description,invoice_date
0,u1785,536365,85123A,6,2.55,United Kingdom,CREAM HANGING HEART T-LIGHT HOLDER,2010-12-01 08:26:00
1,u13047,536368,22914,3,4.95,United Kingdom,BLUE COAT RACK PARIS FASHION,2010-12-01 08:34:00
2,u13047,536367,48187,4,7.95,United Kingdom,DOORMAT NEW ENGLAND,2010-12-01 08:34:00
3,u12583,536370,22726,12,3.75,France,ALARM CLOCK BAKELIKE GREEN,2010-12-01 08:45:00
4,u1785,536375,82482,6,2.10,United Kingdom,WOODEN PICTURE FRAME WHITE FINISH,2010-12-01 09:32:00
...,...,...,...,...,...,...,...,...
405058,u12748,581580,22906,1,1.65,United Kingdom,12 MESSAGE CARDS WITH ENVELOPES,2011-12-09 12:20:00
405059,u12748,581580,23338,1,2.08,United Kingdom,EGG FRYING PAN RED,2011-12-09 12:20:00
405060,u12748,581580,22721,1,1.95,United Kingdom,SET OF 3 CAKE TINS SKETCHBOOK,2011-12-09 12:20:00
405061,u15804,581585,23356,3,5.95,United Kingdom,LOVE HOT WATER BOTTLE,2011-12-09 12:31:00
405062,u13113,581586,22061,8,2.95,United Kingdom,LARGE CAKE STAND HANGING STRAWBERY,2011-12-09 12:49:00

In [10]:
online_trans_w_desc.shape

(405063, 8)

In [11]:
online_trans_w_desc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405063 entries, 0 to 405062
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   customer_id   405063 non-null  object
 1   invoice       405063 non-null  object
 2   stock_code    405063 non-null  object
 3   quantity      405063 non-null  int64
 4   price         405063 non-null  float64
 5   country       405063 non-null  object
 6   description   405063 non-null  object
 7   invoice_date  405063 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(5)
memory usage: 24.7+ MB

In [12]:
online_trans_final = online_trans_w_desc.drop_duplicates(keep='first')
online_trans_final.head()

,customer_id,invoice,stock_code,quantity,price,country,description,invoice_date
0,u1785,536365,85123A,6,2.55,United Kingdom,CREAM HANGING HEART T-LIGHT HOLDER,2010-12-01 08:26:00
1,u13047,536368,22914,3,4.95,United Kingdom,BLUE COAT RACK PARIS FASHION,2010-12-01 08:34:00
2,u13047,536367,48187,4,7.95,United Kingdom,DOORMAT NEW ENGLAND,2010-12-01 08:34:00
3,u12583,536370,22726,12,3.75,France,ALARM CLOCK BAKELIKE GREEN,2010-12-01 08:45:00
4,u1785,536375,82482,6,2.10,United Kingdom,WOODEN PICTURE FRAME WHITE FINISH,2010-12-01 09:32:00

In [13]:
online_trans_final.duplicated().sum()

0

In [14]:
online_trans_final.info()

<class 'pandas.core.frame.DataFrame'>
Index: 399841 entries, 0 to 405062
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   customer_id   399841 non-null  object
 1   invoice       399841 non-null  object
 2   stock_code    399841 non-null  object
 3   quantity      399841 non-null  int64
 4   price         399841 non-null  float64
 5   country       399841 non-null  object
 6   description   399841 non-null  object
 7   invoice_date  399841 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(5)
memory usage: 27.5+ MB

In [15]:
print(online_trans_w_desc.shape)
print(online_trans_final.shape)

(405063, 8)
(399841, 8)

In [16]:
AWS_ACCESS_KEY_ID = "AKIAZB6R2A6AG5XE6AHP"
AWS_SECRET_ACCESS_KEY = "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" 
AWS_S3_BUCKET = 'july-bootcamp'

In [22]:
def connect_to_s3(aws_access_key_id, aws_secret_access_key):
    """Methods that connects to s3"""

    s3_client = boto3.client(
        "s3",
        aws_access_key_id=aws_access_key_id,
        aws_secret_access_key=aws_secret_access_key
    )

    print("Connection to s3 made")
    
    return s3_client


def df_to_s3(df, key, s3_bucket, aws_access_key_id, aws_secret_access_key):
    """Function that writes a data frame as a .csv file to a s3 bucket"""
    
    file_type = key[-4:]
    
    if file_type == '.pkl':
        buffer = BytesIO()  # create buffer to temporarily store the Data Frame
        df.to_pickle(buffer)  # code to write the data frame as .pkl file
    
    if file_type == '.csv':
        buffer = StringIO()  # create buffer to temporarily store the Data Frame
        df.to_csv(buffer, index = False)  # code to write the data frame as .csv file

    s3_client = connect_to_s3(aws_access_key_id, aws_secret_access_key)

    s3_client.put_object(
        Bucket=s3_bucket, Key=key, Body=buffer.getvalue()
    )  # this code writes the temp stored file and writes to s3


    print(f"The transformed data is saved as pickle in the following location s3://{s3_bucket}/{key}")

In [23]:
key = 'monday_transformations/cm_online_transactions_v2.pkl'
df_to_s3(online_trans_final, key, AWS_S3_BUCKET, AWS_ACCESS_KEY_ID, AWS_SECRET_ACCESS_KEY )

Connection to s3 made
The transformed data is saved as pickle in the following location s3://july-bootcamp/monday_transformations/cm_online_transactions_v2.pkl

In [21]:
# store your data frame locally

online_trans_final.to_pickle("../data/online_transactions_v2.pkl")